openmv/openmv/lib/mimxrt/MIMXRT1064/drivers/fsl_lpspi.c
        /*Wait until TX FIFO is not full*/
#if SPI_RETRY_TIMES
        uint32_t waitTimes = SPI_RETRY_TIMES;
        while ((LPSPI_GetTxFifoCount(base) == LPSPI_GetRxFifoSize(base)) && (--waitTimes) != 0U)
#else
        while (LPSPI_GetTxFifoCount(base) == LPSPI_GetRxFifoSize(base))
#endif
            {
            }
#if SPI_RETRY_TIMES
        if (waitTimes == 0U)
        {
            return false;
        }
#endif

        /* To prevent rxfifo overflow, ensure transmitting and receiving are executed in parallel */
        if (((NULL == (transfer->rxData)) ||
             ((stateParams->rxRemainingByteCount) - txRemainingByteCount) < rxFifoMaxBytes))
        {
            if (stateParams->isTxMask)
            {
                /* When TCR[TXMSK]=1, transfer is initiate by writting a new command word to TCR. TCR[TXMSK] is cleared
                   by hardware every time when TCR[FRAMESZ] bit of data is transfered.
                   In this case TCR[TXMSK] should be set to initiate each transfer. */
                base->TCR |= LPSPI_TCR_TXMSK_MASK;
                if (stateParams->isPcsContinuous && (txRemainingByteCount == bytesPerFrame))
                {
                    /* For the last piece of frame size of data, if is PCS continous mode(TCR[CONT]), TCR[CONTC] should
                     * be cleared to de-assert the PCS. Be sure to clear the TXMSK as well otherwise another FRAMESZ
                     * of data will be received. */
                    base->TCR &= ~(LPSPI_TCR_CONTC_MASK | LPSPI_TCR_CONT_MASK | LPSPI_TCR_TXMSK_MASK);
                }
                txRemainingByteCount -= bytesPerFrame;
            }
            else
            {
                if ((transfer->txData) != NULL)
                {
                    wordToSend = LPSPI_CombineWriteData((transfer->txData), (stateParams->bytesEachWrite), isByteSwap);
                    (transfer->txData) += (stateParams->bytesEachWrite);
                }
                /* Otherwise push data to tx FIFO to initiate transfer */
                LPSPI_WriteData(base, wordToSend);
                txRemainingByteCount -= (stateParams->bytesEachWrite);
            }
        }

        /* Check whether there is RX data in RX FIFO . Read out the RX data so that the RX FIFO would not overrun. */
        if (((transfer->rxData) != NULL) && ((stateParams->rxRemainingByteCount) != 0U))
        {
            /* To ensure parallel execution in 3-wire mode, after writting 1 to TXMSK to generate clock of
               bytesPerFrame's data wait until bytesPerFrame's data is received. */
            while ((stateParams->isTxMask) && (LPSPI_GetRxFifoCount(base) == 0U))
            {
            }
#if SPI_RETRY_TIMES
            uint32_t waitTimes = SPI_RETRY_TIMES;
            while ((LPSPI_GetRxFifoCount(base) != 0U) && (--waitTimes != 0U))
#else
            while (LPSPI_GetRxFifoCount(base) != 0U)
#endif
            {
                readData = LPSPI_ReadData(base);
                if ((stateParams->rxRemainingByteCount) < (stateParams->bytesEachRead))
                {
                    (stateParams->bytesEachRead) = (uint8_t)(stateParams->rxRemainingByteCount);
                }

                LPSPI_SeparateReadData((transfer->rxData), readData, (stateParams->bytesEachRead), isByteSwap);
                (transfer->rxData) += (stateParams->bytesEachRead);

                (stateParams->rxRemainingByteCount) -= (stateParams->bytesEachRead);
            }
#if SPI_RETRY_TIMES
            if (waitTimes == 0U)
            {
                return false;
            }
#endif
        }
    }
    return true;
}

static bool LPSPI_MasterTransferClearTCR(LPSPI_Type *base, lpspi_transfer_blocking_param_t *stateParams)
{
#if SPI_RETRY_TIMES
    uint32_t waitTimes = SPI_RETRY_TIMES;
    while ((LPSPI_GetTxFifoCount(base) == LPSPI_GetRxFifoSize(base)) && (--waitTimes != 0U))
#else
    while (LPSPI_GetTxFifoCount(base) == LPSPI_GetRxFifoSize(base))
#endif
    {
    }
#if SPI_RETRY_TIMES
    if (waitTimes == 0U)
    {
        return false;
    }
#endif
    base->TCR = (base->TCR & ~(LPSPI_TCR_CONTC_MASK | LPSPI_TCR_CONT_MASK));
    return true;
}

static bool LPSPI_MasterTransferReadDataInFifo(LPSPI_Type *base,
                                               lpspi_transfer_t *transfer,
                                               lpspi_transfer_blocking_param_t *stateParams)
{
    uint32_t readData;
    bool isByteSwap = ((transfer->configFlags & (uint32_t)kLPSPI_MasterByteSwap) != 0U);
    while ((stateParams->rxRemainingByteCount) > 0U)
    {
#if SPI_RETRY_TIMES
        uint32_t waitTimes = SPI_RETRY_TIMES;
        while ((LPSPI_GetRxFifoCount(base) != 0U) && (--waitTimes != 0U))
#else
        while (LPSPI_GetRxFifoCount(base) != 0U)
#endif
        {
            readData = LPSPI_ReadData(base);

            if ((stateParams->rxRemainingByteCount) < (stateParams->bytesEachRead))
            {
                (stateParams->bytesEachRead) = (uint8_t)(stateParams->rxRemainingByteCount);
            }

            LPSPI_SeparateReadData((transfer->rxData), readData, (stateParams->bytesEachRead), isByteSwap);
            (transfer->rxData) += (stateParams->bytesEachRead);

            (stateParams->rxRemainingByteCount) -= (stateParams->bytesEachRead);
        }
#if SPI_RETRY_TIMES
        if (waitTimes == 0U)
        {
            return false;
        }
#endif
    }
    return true;
}

static bool LPSPI_MasterTransferReadDataInFifoNoBuf(LPSPI_Type *base, lpspi_transfer_blocking_param_t *stateParams)
{
#if SPI_RETRY_TIMES
    uint32_t waitTimes = SPI_RETRY_TIMES;
    while (((LPSPI_GetStatusFlags(base) & (uint32_t)kLPSPI_TransferCompleteFlag) == 0U) && (--waitTimes != 0U))
#else
    while ((LPSPI_GetStatusFlags(base) & (uint32_t)kLPSPI_TransferCompleteFlag) == 0U)
#endif
    {
    }
#if SPI_RETRY_TIMES
    if (waitTimes == 0U)
    {
        return false;
    }
#endif
    return true;
}

/*!
 * brief LPSPI master transfer data using a polling method.
 *
 * This function transfers data using a  polling method. This is a blocking function, which does not return until all
 * transfers have been completed.
 *
 * Note:
 * The transfer data size should be integer multiples of bytesPerFrame if bytesPerFrame is less than or equal to 4.
 * For bytesPerFrame greater than 4:
 * The transfer data size should be equal to bytesPerFrame if the bytesPerFrame is not integer multiples of 4.
 * Otherwise, the transfer data size can be an integer multiple of bytesPerFrame.
 *
 * param base LPSPI peripheral address.
 * param transfer pointer to lpspi_transfer_t structure.
 * return status of status_t.
 */
status_t LPSPI_MasterTransferBlocking(LPSPI_Type *base, lpspi_transfer_t *transfer)
{
    assert(transfer != NULL);

    /* Check that LPSPI is not busy.*/
    if ((LPSPI_GetStatusFlags(base) & (uint32_t)kLPSPI_ModuleBusyFlag) != 0U)
    {
        return kStatus_LPSPI_Busy;
    }
    LPSPI_Enable(base, false);
    /* Check arguements */
    if (!LPSPI_CheckTransferArgument(base, transfer, false))
    {
        return kStatus_InvalidArgument;
    }

    LPSPI_FlushFifo(base, true, true);
    LPSPI_ClearStatusFlags(base, (uint32_t)kLPSPI_AllStatusFlag);

    /* Variables */
    uint32_t whichPcs = (transfer->configFlags & LPSPI_MASTER_PCS_MASK) >> LPSPI_MASTER_PCS_SHIFT;
    uint32_t temp     = (base->CFGR1 & LPSPI_CFGR1_PINCFG_MASK);
    lpspi_transfer_blocking_param_t stateParams;
    (void)memset(&stateParams, 0, sizeof(stateParams));

    stateParams.isTxMask             = false;
    stateParams.rxRemainingByteCount = transfer->dataSize;
    /*The TX and RX FIFO sizes are always the same*/
    uint32_t bytesPerFrame = ((base->TCR & LPSPI_TCR_FRAMESZ_MASK) >> LPSPI_TCR_FRAMESZ_SHIFT) / 8U + 1U;
    /* No need to configure PCS continous if the transfer byte count is smaller than frame size */
    stateParams.isPcsContinuous = (((transfer->configFlags & (uint32_t)kLPSPI_MasterPcsContinuous) != 0U) &&
                                   (bytesPerFrame < transfer->dataSize));

    /* Mask tx data in half duplex mode */
    if (((temp == LPSPI_CFGR1_PINCFG(kLPSPI_SdiInSdiOut)) || (temp == LPSPI_CFGR1_PINCFG(kLPSPI_SdoInSdoOut))) &&
        (transfer->txData == NULL))
    {
        stateParams.isTxMask = true;
    }

    base->CFGR1 &= (~LPSPI_CFGR1_NOSTALL_MASK);
    LPSPI_Enable(base, true);

